Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

In [97]:
import pandas as pd
import numpy as np

SERIES

In [98]:
d=np.array([77,6,33,2])
s=pd.Series(d)
print(s)

0    77
1     6
2    33
3     2
dtype: int32

In [99]:
# custom indexing

d=[77,11,6,33,2]
s=pd.Series(d,index=[100,101,102,103,104])
print(s)

100    77
101    11
102     6
103    33
104     2
dtype: int64

In [100]:
#creating series from dictionary

d={'a':10,'b':20,'c':30,'d':40,'e':50}
s=pd.Series(d)
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [101]:
# accessing elemnts from series

s=pd.Series([77,6,33,2],index=['a','b','c','d'])
print(s[0])
print(s['c'])

77
33

In [102]:
s=pd.Series([77,6,33,2],index=['a','b','c','d'])
print(s[:3])
print(s[-3:])

a    77
b     6
c    33
dtype: int64
b     6
c    33
d     2
dtype: int64

In [103]:
s=pd.Series([77,6,33,2],index=['a','b','c','d'])
print(s[['c','a','d']])

c    33
a    77
d     2
dtype: int64

DATA-FRAME

In [104]:
ls =["ab","ce","df","mn","pq"]
df = pd.DataFrame(ls)
print(df)

    0
0  ab
1  ce
2  df
3  mn
4  pq

In [105]:
dict ={'name' :["ab","ce","df","mn","pq" ],'roll' :[ 1,2,6,4,3]}
df = pd.DataFrame(dict)
print(df)

  name  roll
0   ab     1
1   ce     2
2   df     6
3   mn     4
4   pq     3

In [106]:
df.name

0    ab
1    ce
2    df
3    mn
4    pq
Name: name, dtype: object

In [107]:
df[["name","roll"]]

  name  roll
0   ab     1
1   ce     2
2   df     6
3   mn     4
4   pq     3

In [108]:
d=pd.read_csv("C:/Users/2002m/OneDrive/Documents/CSV FILES/hrc.csv")
d.head(10)

,business_code,cust_number,name_customer,clear_date,buisness_year,doc_id,posting_date,document_create_date,document_create_date.1,due_in_date,invoice_currency,document type,posting_id,area_business,total_open_amount,baseline_create_date,cust_payment_terms,invoice_id,isOpen
0,U001,0200769623,WAL-MAR corp,2020-02-11 00:00:00,2020.0,1.930438e+09,2020-01-26,20200125,20200126,20200210.0,USD,RV,1.0,NaN,54273.28,20200126.0,NAH4,1.930438e+09,0
1,U001,0200980828,BEN E,2019-08-08 00:00:00,2019.0,1.929646e+09,2019-07-22,20190722,20190722,20190811.0,USD,RV,1.0,NaN,79656.60,20190722.0,NAD1,1.929646e+09,0
2,U001,0200792734,MDV/ trust,2019-12-30 00:00:00,2019.0,1.929874e+09,2019-09-14,20190914,20190914,20190929.0,USD,RV,1.0,NaN,2253.86,20190914.0,NAA8,1.929874e+09,0
3,CA02,0140105686,SYSC llc,NaN,2020.0,2.960623e+09,2020-03-30,20200330,20200330,20200410.0,CAD,RV,1.0,NaN,3299.70,20200331.0,CA10,2.960623e+09,1
4,U001,0200769623,WAL-MAR foundation,2019-11-25 00:00:00,2019.0,1.930148e+09,2019-11-13,20191113,20191113,20191128.0,USD,RV,1.0,NaN,33133.29,20191113.0,NAH4,1.930148e+09,0
5,CA02,0140106181,THE corporation,2019-12-04 00:00:00,2019.0,2.960581e+09,2019-09-20,20190920,20190920,20191004.0,CAD,RV,1.0,NaN,22225.84,20190924.0,CA10,2.960581e+09,0
6,U001,0200769623,WAL-MAR in,2019-11-12 00:00:00,2019.0,1.930083e+09,2019-11-01,20191031,20191101,20191116.0,USD,RV,1.0,NaN,7358.49,20191101.0,NAH4,1.930083e+09,0
7,U001,0200744019,TARG us,NaN,2020.0,1.930659e+09,2020-03-19,20200318,20200319,20200403.0,USD,RV,1.0,NaN,11173.02,20200319.0,NAA8,1.930659e+09,1
8,U001,0200769623,WAL-MAR corp,2019-06-18 00:00:00,2019.0,1.929440e+09,2019-06-07,20190605,20190607,20190622.0,USD,RV,1.0,NaN,15995.04,20190607.0,NAH4,1.929440e+09,0
9,U001,0200762301,C&S WH systems,2019-03-06 00:00:00,2019.0,1.928819e+09,2019-02-20,20190219,20190220,20190307.0,USD,RV,1.0,NaN,28.63,20190220.0,NAC6,1.928819e+09,0

In [109]:
d.describe()

,buisness_year,doc_id,document_create_date,document_create_date.1,due_in_date,posting_id,area_business,total_open_amount,baseline_create_date,invoice_id,isOpen
count,50000.000000,5.000000e+04,5.000000e+04,5.000000e+04,5.000000e+04,50000.0,0.0,50000.000000,5.000000e+04,4.999400e+04,50000.000000
mean,2019.305700,2.012238e+09,2.019351e+07,2.019354e+07,2.019368e+07,1.0,NaN,32337.021651,2.019354e+07,2.011340e+09,0.200000
std,0.460708,2.885235e+08,4.496041e+03,4.482134e+03,4.470614e+03,0.0,NaN,39205.975231,4.482701e+03,2.766335e+08,0.400004
min,2019.000000,1.928502e+09,2.018123e+07,2.018123e+07,2.018122e+07,1.0,NaN,0.720000,2.018121e+07,1.928502e+09,0.000000
25%,2019.000000,1.929342e+09,2.019050e+07,2.019051e+07,2.019052e+07,1.0,NaN,4928.312500,2.019050e+07,1.929342e+09,0.000000
50%,2019.000000,1.929964e+09,2.019091e+07,2.019091e+07,2.019093e+07,1.0,NaN,17609.010000,2.019091e+07,1.929964e+09,0.000000
75%,2020.000000,1.930619e+09,2.020013e+07,2.020013e+07,2.020022e+07,1.0,NaN,47133.635000,2.020013e+07,1.930619e+09,0.000000
max,2020.000000,9.500000e+09,2.020052e+07,2.020052e+07,2.020071e+07,1.0,NaN,668593.360000,2.020052e+07,2.960636e+09,1.000000

In [110]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 19 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   business_code           50000 non-null  object
 1   cust_number             50000 non-null  object
 2   name_customer           50000 non-null  object
 3   clear_date              40000 non-null  object
 4   buisness_year           50000 non-null  float64
 5   doc_id                  50000 non-null  float64
 6   posting_date            50000 non-null  object
 7   document_create_date    50000 non-null  int64
 8   document_create_date.1  50000 non-null  int64
 9   due_in_date             50000 non-null  float64
 10  invoice_currency        50000 non-null  object
 11  document type           50000 non-null  object
 12  posting_id              50000 non-null  float64
 13  area_business           0 non-null      float64
 14  total_open_amount       50000 non-null  float64
 15  baseline_create_date    50000 non-null  float64
 16  cust_payment_terms      50000 non-null  object
 17  invoice_id              49994 non-null  float64
 18  isOpen                  50000 non-null  int64
dtypes: float64(8), int64(3), object(8)
memory usage: 7.2+ MB

In [111]:
df.head()

  name  roll
0   ab     1
1   ce     2
2   df     6
3   mn     4
4   pq     3

ADDING ROWS TO THE DATFRAMES

In [112]:
data=[{"name" : 'mp', "roll" :7}]
df.append(data)

## df.append(data,ignore_index=True,sort=False)

  name  roll
0   ab     1
1   ce     2
2   df     6
3   mn     4
4   pq     3
0   mp     7

In [113]:
data=[{"name" : 'uv', "roll" :9}]
df.loc[6]=list(data[0].values())
df

  name  roll
0   ab     1
1   ce     2
2   df     6
3   mn     4
4   pq     3
6   uv     9

ADDING COLUMN TO THE DATAFRAMES

In [114]:
marks = [90,98,76,85,87,None]
df["marks"]=marks
df

#df=df.assign(marks=[90,98,76,85,87,77])
#df

  name  roll  marks
0   ab     1   90.0
1   ce     2   98.0
2   df     6   76.0
3   mn     4   85.0
4   pq     3   87.0
6   uv     9    NaN

In [115]:
df=df.assign(grades=["O","O","A","E",None,"E"],regnum=[223,768,454,786,332,897])
df

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   mn     4   85.0      E     786
4   pq     3   87.0   None     332
6   uv     9    NaN      E     897

DROPPING ROWS AND COLUMNS

In [116]:
df.drop("regnum",axis=1)

#axis 1 : for columns
#axis 0 : for rows

  name  roll  marks grades
0   ab     1   90.0      O
1   ce     2   98.0      O
2   df     6   76.0      A
3   mn     4   85.0      E
4   pq     3   87.0   None
6   uv     9    NaN      E

In [117]:
df.drop(6,axis=0)

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   mn     4   85.0      E     786
4   pq     3   87.0   None     332

In [118]:
df.drop(columns=["regnum"])

  name  roll  marks grades
0   ab     1   90.0      O
1   ce     2   98.0      O
2   df     6   76.0      A
3   mn     4   85.0      E
4   pq     3   87.0   None
6   uv     9    NaN      E

In [119]:
df.drop([4,6])

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   mn     4   85.0      E     786

SORTING DATAFRAMES

In [120]:
df.sort_values("regnum")

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
4   pq     3   87.0   None     332
2   df     6   76.0      A     454
1   ce     2   98.0      O     768
3   mn     4   85.0      E     786
6   uv     9    NaN      E     897

In [121]:
df.sort_values( by="regnum", ascending=False)

  name  roll  marks grades  regnum
6   uv     9    NaN      E     897
3   mn     4   85.0      E     786
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
4   pq     3   87.0   None     332
0   ab     1   90.0      O     223

NULL HANDLEING

In [122]:
#isna() : checking the null values

ser=pd.Series([None,50,None,77,80])
ser

0     NaN
1    50.0
2     NaN
3    77.0
4    80.0
dtype: float64

In [123]:
ser.isna()

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [124]:
df.isna()

    name   roll  marks  grades  regnum
0  False  False  False   False   False
1  False  False  False   False   False
2  False  False  False   False   False
3  False  False  False   False   False
4  False  False  False    True   False
6  False  False   True   False   False

In [125]:
#notna : picks out the data with not null values

df.notna()

   name  roll  marks  grades  regnum
0  True  True   True    True    True
1  True  True   True    True    True
2  True  True   True    True    True
3  True  True   True    True    True
4  True  True   True   False    True
6  True  True  False    True    True

In [126]:
ser.notna()

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [127]:
#isnull() :detects null values and missing values in the given series or dataframe

s=pd.Series([None,33,"Abc",None])
s

0    None
1      33
2     Abc
3    None
dtype: object

In [128]:
s.isnull()

0     True
1    False
2    False
3     True
dtype: bool

In [129]:
#notnull()

s.notnull()

0    False
1     True
2     True
3    False
dtype: bool

In [130]:
#fillna() : manages and lets the user replace NaN values with some value of their own.

df["marks"].fillna(80, inplace = True)
df["grades"].fillna("A", inplace = True)
df

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   mn     4   85.0      E     786
4   pq     3   87.0      A     332
6   uv     9   80.0      E     897

In [131]:
#replace() : 

#replacing for one value
df.replace(to_replace= "mn", value="sm")

  name  roll  marks grades  regnum
0   ab     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   sm     4   85.0      E     786
4   pq     3   87.0      A     332
6   uv     9   80.0      E     897

In [132]:
#replacing for more than one value 

df.replace(to_replace=["ab","pq"],value=["gh","ns"])

  name  roll  marks grades  regnum
0   gh     1   90.0      O     223
1   ce     2   98.0      O     768
2   df     6   76.0      A     454
3   mn     4   85.0      E     786
4   ns     3   87.0      A     332
6   uv     9   80.0      E     897

AGGREGATION OF GROUPS

In [140]:
# SUM()

df.groupby("grades")['marks'].sum()

grades
A    163.0
E    165.0
O    188.0
Name: marks, dtype: float64

In [141]:
# count()

df.groupby("marks")['grades'].count()

marks
76.0    1
80.0    1
85.0    1
87.0    1
90.0    1
98.0    1
Name: grades, dtype: int64

In [142]:
#mean()

df.groupby("grades")['marks'].mean()

grades
A    81.5
E    82.5
O    94.0
Name: marks, dtype: float64

LAMBA FUNCTION

In [147]:
mult=lambda x : x*x
mult(5)

25

In [149]:
string="helloworld"
string[:3]

'hel'

In [153]:
df["first letter"]=df["name"].apply(lambda x: x[ :1])
df

  name  roll  marks grades  regnum first letter
0   ab     1   90.0      O     223            a
1   ce     2   98.0      O     768            c
2   df     6   76.0      A     454            d
3   mn     4   85.0      E     786            m
4   pq     3   87.0      A     332            p
6   uv     9   80.0      E     897            u

In [154]:
df

  name  roll  marks grades  regnum first letter
0   ab     1   90.0      O     223            a
1   ce     2   98.0      O     768            c
2   df     6   76.0      A     454            d
3   mn     4   85.0      E     786            m
4   pq     3   87.0      A     332            p
6   uv     9   80.0      E     897            u

JOIN

In [160]:
d = {'id': [1, 2, 10, 12],'val1': ['a', 'b', 'c', 'd']}
a = pd.DataFrame(d)
a

   id val1
0   1    a
1   2    b
2  10    c
3  12    d

In [161]:
d = {'id': [1, 2, 9, 8],'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
b

   id val1
0   1    p
1   2    q
2   9    r
3   8    s

In [162]:
#inner join

df = pd.merge(a, b, on='id', how='inner')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q

In [163]:
#left join

df = pd.merge(a, b, on='id', how='left')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN

In [164]:
#right join

df = pd.merge(a, b, on='id', how='right')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2   9    NaN      r
3   8    NaN      s

In [165]:
#outer join

df = pd.merge(a, b, on='id', how='outer')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN
4   9    NaN      r
5   8    NaN      s

In [166]:
#index join

df = pd.merge(a, b, left_index=True, right_index=True)
df

   id_x val1_x  id_y val1_y
0     1      a     1      p
1     2      b     2      q
2    10      c     9      r
3    12      d     8      s

CONCATE FUNCTION

In [169]:
#concate

s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

UNIQUE FUNCTION

In [173]:
A=pd.Series([1,2,2,5,33,4,55,33,5,87])
A.unique()

array([ 1,  2,  5, 33,  4, 55, 87], dtype=int64)

NUNIQUE FUNCTION

In [174]:
#counts the unique values

A.nunique()

7

VALUE_COUNTS FUNCTION

In [175]:
#rns a Series containing counts of unique values

A.value_counts()

2     2
5     2
33    2
1     1
4     1
55    1
87    1
dtype: int64

DESCRIBE FUNCTION

In [176]:
A.describe()

count    10.000000
mean     22.700000
std      29.238673
min       1.000000
25%       2.500000
50%       5.000000
75%      33.000000
max      87.000000
dtype: float64

ISIN FUNCTION

In [178]:
#isin() : returns true if the value exists else false

A.isin([2,55])

0    False
1     True
2     True
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [179]:
A.isin(range(1,10))

0     True
1     True
2     True
3     True
4    False
5     True
6    False
7    False
8     True
9    False
dtype: bool